uhnp/src/Documents/АктИнвентаризацииСАТУРН/АктИнвентаризацииСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктИнвентаризацииСАТУРН</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.МестаХраненияПартийСАТУРН</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПартийСАТУРН</registerRecords>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеАктИнвентаризацииСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИнвентаризации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстатокСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/AccumulationRegisters/ОстаткиПартийСАТУРН/ОстаткиПартийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПартийСАТУРН</name>
  <resources>
    <name>КоличествоСАТУРН</name>
    <type>
      <types>DefinedType.КоличествоСАТУРН</types>
    </type>
  </resources>
  <resources>
    <name>ВОбработкеСАТУРН</name>
    <type>
      <types>DefinedType.КоличествоСАТУРН</types>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииСАТУРН</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/МестаХраненияПартийСАТУРН/МестаХраненияПартийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестаХраненияПартийСАТУРН</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииСАТУРН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/ИмпортПродукцииСАТУРН/ИмпортПродукцииСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИмпортПродукцииСАТУРН</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.МестаХраненияПартийСАТУРН</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПартийСАТУРН</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеИмпортПродукцииСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаЭкспортер</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.КлассификаторТранспортныхСредствСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТНАРГУС</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>DefinedType.ТранспортныеСредстваИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПункт</name>
    <type>
      <types>CatalogRef.КлассификаторТаможенныхПунктовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальноеУправление</name>
    <type>
      <types>CatalogRef.КлассификаторТерриториальныхУправленийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПеревозчик</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмпортируемаяПартия</name>
      <type>
        <types>CatalogRef.ИмпортируемаяПартияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/АктИнвентаризацииСАТУРН/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура")Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИмпортПродукцииСАТУРН") Тогда
		
		ЗаполнитьПоИмпортуПродукцииСАТУРН(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнтеграцияСАТУРНПереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Партия");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.НомерПартии");
	
	ШаблонСообщения = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""Товары""';
							|en = 'Не заполнена колонка ""%1"" в строке %2 списка ""Товары""'");
	
	Для Каждого СтрокаТовары Из Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.Партия)
			И (СтрокаТовары.КоличествоУпаковок < 0
			Или Не ЗначениеЗаполнено(СтрокаТовары.НомерПартии)) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru = 'Партия';
															|en = 'Партия'"), СтрокаТовары.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары", СтрокаТовары.НомерСтроки, "Партия"),,
				Отказ);
		КонецЕсли;
	КонецЦикла;
	
	ИнтеграцияСАТУРНПереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Для Каждого СтрокаТовары Из Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.НомерПартии)
			И СтрокаТовары.КоличествоУпаковок < 0 Тогда
			СтрокаТовары.НомерПартии          = "";
			СтрокаТовары.ТорговоеНаименование = "";
			СтрокаТовары.АртикулПроизводителя = "";
			СтрокаТовары.ДатаПроизводства     = Дата(1, 1, 1);
			СтрокаТовары.СрокГодности         = Дата(1, 1, 1);
		КонецЕсли;
	КонецЦикла;
	
	ИнтеграцияСАТУРН.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ИнтеграцияСАТУРН.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = Неопределено;

	Для Каждого СтрокаТаблицы Из Товары Цикл
		СтрокаТаблицы.НомерПартии  = "";
		СтрокаТаблицы.КоличествоОстатокСАТУРН = 0;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.АктИнвентаризацииСАТУРН.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	РегистрыСведений.МестаХраненияПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияИСПереопределяемый.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеСАТУРН.ДанныеЗаполненияАктИнвентаризацииСАТУРН(ОрганизацияСАТУРН);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеСАТУРН.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоИмпортуПродукцииСАТУРН(ДанныеЗаполнения)
	
	ДанныеШапки = ВыборкаДанныхШапкиИмпортПродукции(ДанныеЗаполнения);
	
	Если ДанныеШапки.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеШапки);
		
	КонецЕсли;
	
	ДанныеЗаполненияТЧ = ВыборкаДанныхИмпортаПродукции(ДанныеЗаполнения);
	
	Пока ДанныеЗаполненияТЧ.Следующий() Цикл
		
		СтрокаТЧ = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеЗаполненияТЧ);
		
		СтрокаТЧ.ПричинаРасхождения = НСтр("ru = 'Списание импортной партии';
											|en = 'Списание импортной партии'");
		
		НоваяСтрокаТЧ = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ДанныеЗаполненияТЧ,, "Партия");
		
		НоваяСтрокаТЧ.КоличествоУпаковок = -СтрокаТЧ.КоличествоУпаковок;
		НоваяСтрокаТЧ.ПричинаРасхождения = НСтр("ru = 'Расформирование импортной партии';
												|en = 'Расформирование импортной партии'");
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыборкаДанныхШапкиИмпортПродукции(МассивПлановПрименения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивПлановПрименения);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИмпортПродукцииСАТУРН.ОрганизацияСАТУРН КАК ОрганизацияСАТУРН,
	|	ИмпортПродукцииСАТУРН.МестоХранения     КАК МестоХранения,
	|	ИмпортПродукцииСАТУРН.ДатаПолучения     КАК ДатаРегистрации,
	|	ИмпортПродукцииСАТУРН.Ссылка            КАК ДокументОснование
	|ИЗ
	|	Документ.ИмпортПродукцииСАТУРН КАК ИмпортПродукцииСАТУРН
	|ГДЕ
	|	ИмпортПродукцииСАТУРН.Ссылка В (&Ссылка)";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВыборкаДанныхИмпортаПродукции(МассивПлановПрименения)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивПлановПрименения);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура             КАК Номенклатура,
		|	Товары.Характеристика           КАК Характеристика,
		|	Товары.Серия                    КАК Серия,
		|	Товары.ПАТ                      КАК ПАТ,
		|	Товары.ТипИзмеряемойВеличиныСАТУРН КАК ТипИзмеряемойВеличиныСАТУРН,
		|	Товары.Количество               КАК Количество,
		|	-Товары.КоличествоУпаковок      КАК КоличествоУпаковок,
		|	Товары.Упаковка                 КАК Упаковка,
		|	Товары.Партия                   КАК Партия
		|ИЗ
		|	Документ.ИмпортПродукцииСАТУРН.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка В (&Ссылка)";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
